tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "steipete/tap"
brew "openssl@3"
brew "awscli"
brew "colima", restart_service: :changed
brew "colordiff"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-credential-helper"
brew "emacs"
brew "fnm"
brew "gh"
brew "ghq"
brew "git"
brew "httpie"
brew "jnv"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kustomize"
brew "peco"
brew "python@3.12"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "renovate"
brew "ripgrep"
brew "stern"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "z"
brew "zsh"
brew "leoafarias/fvm/fvm"
brew "steipete/tap/gogcli"
cask "bettertouchtool"
cask "brewlet"
cask "clipy"
cask "dash"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "hiddenbar"
cask "iterm2"
cask "kap"
cask "obsidian"
cask "postman"
cask "shottr"
cask "stats"
cask "tableplus"
vscode "1natsu.insert-br-tag"
vscode "adpyke.vscode-sql-formatter"
vscode "aki77.rails-partial"
vscode "aki77.rails-routes"
vscode "alefragnani.bookmarks"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "arjun.swagger-viewer"
vscode "aws-scripting-guy.cform"
vscode "b-shan.jsonyamlkeynavigator"
vscode "balastrong.close-tabs"
vscode "bibhasdn.unique-lines"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "britesnow.vscode-toggle-quotes"
vscode "byi8220.indented-block-highlighting"
vscode "castwide.solargraph"
vscode "chouzz.vscode-better-align"
vscode "chrislajoie.vscode-modelines"
vscode "chrmarti.ssh"
vscode "coolbear.systemd-unit-file"
vscode "ctf0.close-tabs-to-the-left"
vscode "danielthielking.aws-cloudformation-yaml"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "everettjf.filter-line"
vscode "ezforo.copy-relative-path-and-line-numbers"
vscode "fayras.simple-new-file"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.docker-explorer"
vscode "fwcd.kotlin"
vscode "genieai.chatgpt-vscode"
vscode "gerane.theme-twilight"
vscode "gerrnperl.outline-map"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "iliazeus.vscode-ansi"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "jemmyw.rails-fast-nav"
vscode "johnpapa.vscode-peacock"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "mame.ruby-typeprof"
vscode "marabesi.php-import-checker"
vscode "mathiasfrohlich.kotlin"
vscode "matthewthorning.align-vertically"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtsmfm.vscode-k8s-quick-attach"
vscode "neilbrayfield.php-docblocker"
vscode "nidu.copy-json-path"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel5-snippets"
vscode "p1c2u.docker-compose"
vscode "pavlitsky.yard"
vscode "peakchen90.open-html-in-browser"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rexshi.phpdoc-comment-vscode-plugin"
vscode "rogalmic.bash-debug"
vscode "ryu1kn.partial-diff"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "simonsiefke.svg-preview"
vscode "sirtori.indenticator"
vscode "sleistner.vscode-fileutils"
vscode "sporto.rails-go-to-spec"
vscode "sryze.uridecode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "th7org.eco"
vscode "tommasov.hosts"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
vscode "wwm.better-align"
vscode "xdebug.php-debug"
vscode "zainchen.json"
